using System;
using System.Drawing;
using System.Security.Cryptography.X509Certificates;

namespace Lab06.MenuModule
{
    public class Menu
    {
        public const ushort MENU_OPTIONS_QUANTITY = 10;

        static public void PrintMenu()
        {
            Console.WriteLine(
                """
                ╔════════════════════════════════════════════════════════╗
                ║                       MAIN MENU                        ║
                ╠════════════════════════════════════════════════════════╣
                ║  1. Посчитать количество активных учеников в школе     ║
                ║  2. Найти всех учеников с активными справками          ║
                ║  3. Найти самого старшего ученика класса               ║
                ║  4. Вывести список всех таблиц базы данных             ║
                ║  5. Вывести количество учеников в классе               ║
                ║  6. Вывести все парты и места в классе                 ║
                ║  7. Убрать всех неактивных учеников из класса          ║
                ║  8. Получить текущую версию сервера                    ║
                ║  9. Создать таблицу achiements                         ║
                ║ 10. Вставить тестовые данные в achiements              ║
                ║  0. Выход                                              ║
                ╚════════════════════════════════════════════════════════╝
                """
            );
        }
    }   
}