using System;
using System.Drawing;
using System.Security.Cryptography.X509Certificates;

namespace Lab06.MenuModule
{
    public class Menu
    {
        public const ushort MENU_OPTIONS_QUANTITY = 11;

        static public void PrintMenu()
        {
            Console.WriteLine(
                """
                ╔══════════════════════════════════════════════════════════════╗
                ║                         MAIN MENU                            ║
                ╠══════════════════════════════════════════════════════════════╣
                ║  1. Посчитать количество активных учеников в школе           ║
                ║  2. Найти всех учеников с активными справками                ║
                ║  3. Найти самого старшего ученика класса                     ║
                ║  4. Вывести список всех таблиц базы данных                   ║
                ║  5. Вывести количество учеников в классе                     ║
                ║  6. Вывести таблицу всех медицинских сертификатов студента   ║
                ║  7. Поменять классного руководителя у класса                 ║
                ║  8. Получить текущую версию сервера                          ║
                ║  9. Создать таблицу achiements                               ║
                ║ 10. Вставить тестовые данные в achiements                    ║
                ║ 11. Выполнить задание защиты                                 ║
                ║  0. Выход                                                    ║
                ╚══════════════════════════════════════════════════════════════╝
                """
            );
        }
    }   
}